readme.org

#+TITLE: Express Ts Project Setup And Emacs
* Emacs IDE for express, typescript project.
** Edit > ESlint > Prettier Automation
*** Eslint Prettier Middleware
I have wrote a small middleware to use =prettier-eslint= for Emacs editor. This middleware check original file if the code is eslint. It uses prettify with =prettier-eslint=. Everytime developer change the code and save it, emacs runs the code below
- Eslint + Prettier
  - Run prettier middler ware on save
  - Reload Buffer on change of the file
   #+begin_src lisp
  (defun run-eslint-prettier()
    (interactive)
    (defvar running-command (concat "node " (projectile-project-root) ".prettier.js " (buffer-file-name)))
    (defvar running-command-parameter (concat (projectile-project-root) ".prettier.js"))
    (defvar running-process nil)
    (defvar running-process-buffer-name "*run eslint-prettier*")
    (progn (call-process
            "node" nil nil nil
            running-command-parameter buffer-file-name)
           (revert-buffer t t t)))
   #+end_src

**** How to use

** Emacs Node Debugger
- indium
  =.indium.json= file
#+begin_src json
{
  "configurations": [
    {
      "program": "node", //이거 중요
      "name": "Web project",
      "type": "node",
      "inspect-brk": true
    }
  ]
}
#+end_src
** Project dependencies
- express
- node
- typescript
** Eslint
- eslint
  =eslint --init=
- prettier
- prettier-eslint
